app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
---
      <% else %>
        <% @name = post.user.firstname + " " + post.user.surname %>

SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ? AND (created_at > '2017-11-30 17:49:02.368991')  [["post_id", 1]]
---
        <td><%= checkPosts(post, current_user.id) %></td>
	<td><%= post.replies.count+1 %></td>