app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
---
    <% else %>
	    <p><%= @post.user.firstname + " " + @post.user.surname %></p>

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
  <hr>
  <% @post.replies.each do |reply| %>