app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page],
			   per_page: params[:per_page])
                 .order('created_at DESC')
---
SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]

  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save
	@userPost = UserPostTime.new
	@userPost.post_id = @post.id
	@userPost.user_id = @post.user_id
	@userPost.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "anonymous") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Assignment help"], ["body", "I need help"], ["user_id", 41], ["created_at", "2017-11-30 17:06:26.806034"], ["updated_at", "2017-11-30 17:06:26.806034"], ["anonymous", "t"]]
INSERT INTO "user_post_times" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 41], ["post_id", 1], ["created_at", "2017-11-30 17:49:02.368991"], ["updated_at", "2017-11-30 17:49:02.368991"]]